# 1
# Сформувати список list_1 із цілих чисел із діапазону [0 ,20] із кроком 2
# із використанням функції range() та конструктора list(). Виконати такі дії
# вивести елементи з непарними індексами;
# вивести елементи з початку і до 5-го включно, з 3-го і до
# передостаннього включно з кроком 2;
# вивести елементи списку у зворотному порядку із використанням
# слайдів та із використанням методів списків;
# поміняти місцями перший та останній елементи списку із
# використанням індексів та із використанням методів списків;
# перевірити, чи є число 0 у списку

print("==" * 80 + "\n")
print("Завдання 1\n")
print("==" * 80 + "\n")

list_1 = list(range(0, 21, 2))

print(f"Список з цілих чисел із діапазону [0 ,20] із кроком 2: {list_1}\n")
print(f"Елементи з непарними індексами: {list_1[1::2]}\n")
print(f"Елементи з початку і до 5-го включно: {list_1[:6]}\n")
print(f"Елементи списку з 3-го і до передостаннього включно з кроком 2: {list_1[3:-1:2]}\n")
print(f"Елементи списку у зворотному порядку із використанням слайсів: {list_1[::-1]}\n")
print(f"Елементи списку у зворотному порядку із використанням методів списків: {list(reversed(list_1))}\n")

list_copy = list_1.copy()

list_copy[0], list_copy[-1] = list_copy[-1], list_copy[0]

print(f"Поміняти місцями перший та останній елементи списку із використанням індексів: {list_copy}\n")

first = list_1.pop(0)
last = list_1.pop(-1)

list_1.insert(0, last)
list_1.append(first)

print(f"Поміняти місцями перший та останній елементи списку із використанням методів списків: {list_1}\n")
print(f"Перевірити, чи є число 0 у списку: {0 in list_1}\n")

# 2
# Сформувати список list_2 із 10 випадкових цілих чисел із діапазону [-
# 7,7] із використанням бібліотеки random. Виконати такі дії
# вивести мінімальний та максимальний елементи списку;
# знайти довжину списку та суму його елементів;
# знайти індекси мінімального та максимального елементів;
# поміняти місцями максимальний та мінімальний елементи;
# вивести відсортовану копію списку

print("==" * 80 + "\n")
print("Завдання 2\n")
print("==" * 80 + "\n")

import random

list_2 = list(random.randint(-7, 7) for _ in range(10))

print(f"Список з 10 випадкових цілих чисел із діапазону [-7,7]: {list_2}\n")