# 1
# Сформувати список list_1 із цілих чисел із діапазону [0 ,20] із кроком 2
# із використанням функції range() та конструктора list(). Виконати такі дії
# вивести елементи з непарними індексами;
# вивести елементи з початку і до 5-го включно, з 3-го і до
# передостаннього включно з кроком 2;
# вивести елементи списку у зворотному порядку із використанням
# слайдів та із використанням методів списків;
# поміняти місцями перший та останній елементи списку із
# використанням індексів та із використанням методів списків;
# перевірити, чи є число 0 у списку

list_1 = list(range(0, 21, 2))

print(f"Список з цілих чисел із діапазону [0 ,20] із кроком 2: {list_1}")
print(f"Елементи з непарними індексами: {list_1[1::2]}")
print(f"Елементи з початку і до 5-го включно: {list_1[:6]}")
print(f"Елементи списку з 3-го і до передостаннього включно з кроком 2: {list_1[3:-1:2]}")
print(f"Елементи списку у зворотному порядку із використанням слайсів: {list_1[::-1]}")
print(f"Елементи списку у зворотному порядку із використанням методів списків: {list(reversed(list_1))}")

list_2 = list_1.copy()

list_2[0], list_2[-1] = list_2[-1], list_2[0]

print(f"Поміняти місцями перший та останній елементи списку із використанням індексів: {list_2}")

first = list_1.pop(0)
last = list_1.pop(-1)

list_1.insert(0, last)
list_1.append(first)

print(f"Поміняти місцями перший та останній елементи списку із використанням методів списків: {list_1}")
print(f"Перевірити, чи є число 0 у списку: {0 in list_1}")