# 1
# Сформувати список list_1 із цілих чисел із діапазону [0 ,20] із кроком 2
# із використанням функції range() та конструктора list(). Виконати такі дії
# вивести елементи з непарними індексами;
# вивести елементи з початку і до 5-го включно, з 3-го і до
# передостаннього включно з кроком 2;
# вивести елементи списку у зворотному порядку із використанням
# слайдів та із використанням методів списків;
# поміняти місцями перший та останній елементи списку із
# використанням індексів та із використанням методів списків;
# перевірити, чи є число 0 у списку

list_1 = list(range(0, 21, 2))

print(f"Список з цілих чисел із діапазону [0 ,20] із кроком 2: {list_1}")